n=int(input())
units=["","один","два","три","четыре","пять","шесть","семь","восемь","девять"]
teens=["десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"]
tens=["","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"]
hundreds=["","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"]
if n==1000:
    print("тысяча")
else:
    h=n//100
    t=n%100//10
    u=n%10
    result=hundreds[h]
    if t==1:
        result+=" "+teens[u]
    else:
        result+=" "+tens[t]
        result+=" "+units[u]
    print(result.strip())
